In [1]:
import pandas as pd

In [2]:
df = pd.read_html('http://sos.ga.gov/elections/election_results/2006_1107/299.htm')

In [3]:
df = df[0]

In [4]:
df.head(5)

          0    1    2                         3
0       NaN  NaN  NaN  Thompson (NP)  1,596,458
1       NaN  NaN  NaN                    100.0%
2    County   PR   TP                       NaN
3   APPLING   19   19                      2772
4  ATKINSON    6    6                      1009

In [5]:
df = df[3:]

In [6]:
df.head(5)

          0   1   2     3
3   APPLING  19  19  2772
4  ATKINSON   6   6  1009
5     BACON   7   7  1503
6     BAKER   7   7   650
7   BALDWIN  16  16  8370

In [7]:
df = df.drop(df.columns[[1,2]], axis=1)

In [8]:
df.head(5)

          0     3
3   APPLING  2772
4  ATKINSON  1009
5     BACON  1503
6     BAKER   650
7   BALDWIN  8370

In [9]:
df.columns = ['county', 'Hugh P. Thompson']

In [10]:
df.tail(5)

        county Hugh P. Thompson
157  WHITFIELD            12909
158     WILCOX             1505
159     WILKES             1959
160  WILKINSON             2092
161      WORTH             3897

In [11]:
df = df.melt(id_vars=['county'])

In [12]:
df.columns = ['county', 'candidate', 'votes']

In [13]:
df.head()

     county         candidate votes
0   APPLING  Hugh P. Thompson  2772
1  ATKINSON  Hugh P. Thompson  1009
2     BACON  Hugh P. Thompson  1503
3     BAKER  Hugh P. Thompson   650
4   BALDWIN  Hugh P. Thompson  8370

In [14]:
df['votes'] = df['votes'].astype(int)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 159 entries, 0 to 158
Data columns (total 3 columns):
county       159 non-null object
candidate    159 non-null object
votes        159 non-null int64
dtypes: int64(1), object(2)
memory usage: 3.8+ KB

In [16]:
df['office'] = 'Supreme Court Justice'

In [17]:
df['district'] = ''

In [18]:
df['party'] = 'Non-Partisan'

In [19]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate         party
Hugh P. Thompson  Non-Partisan    1596458
Name: votes, dtype: int64

In [20]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

,county,office,district,party,candidate,votes
0,APPLING,Supreme Court Justice,,Non-Partisan,Hugh P. Thompson,2772
1,ATKINSON,Supreme Court Justice,,Non-Partisan,Hugh P. Thompson,1009
2,BACON,Supreme Court Justice,,Non-Partisan,Hugh P. Thompson,1503
3,BAKER,Supreme Court Justice,,Non-Partisan,Hugh P. Thompson,650
4,BALDWIN,Supreme Court Justice,,Non-Partisan,Hugh P. Thompson,8370

In [21]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')